---
kind: type
id: T:Autodesk.Revit.DB.Visual.SolidglassTransmittanceType
source: html/ef0c2dea-babe-b184-6321-a958ba387e9b.htm
---
# Autodesk.Revit.DB.Visual.SolidglassTransmittanceType

The enumerated type representing the permitted values for the asset property "SolidglassTransmittance" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public enum SolidglassTransmittanceType
```